common/components/DirectoryHelpers.php

    public static function GetDirWorksheet($worksheetid) {

        //jika tidak mempunyai gambar maka akan di set sampul secara default.
        $model = Worksheets::findOne($worksheetid);
---
SELECT * FROM `worksheets` WHERE `ID`='1'