backend/modules/member/controllers/MemberController.php

                    }

                    //delete dlu di memberloanauthorizeLocaitons where NoAnggota
                    $rowDeleted = \common\models\Memberloanauthorizelocation::deleteAll('Member_id = :memberId', [':memberId' => $model->ID]);
---
DELETE FROM `memberloanauthorizelocation` WHERE Member_id = 3

                    }

                     //delete dlu di memberloanauthorizeCategory where NoAnggota
                    $rowDeletedCategory = \common\models\Memberloanauthorizecategory::deleteAll('Member_id = :memberId', [':memberId' => $model->ID]);
---
DELETE FROM `memberloanauthorizecategory` WHERE Member_id = 3

            // Binding location and Collection fro default create
            $model->locationCategory = $this->getLocationDefaultByMember($model->ID);
            $model->collectionCategory = $this->getCategoryCollectionDefaultByMember($model->ID);
            $biaya = JenisAnggota::findOne(1);
---
SELECT * FROM `jenis_anggota` WHERE `id`=1

    public function actionHistoriPeminjaman($id) {
        $model = $this->findModel($id);

        $username = Yii::$app->user->identity->username;
        $modelUser = \common\models\UserSetting::findByUsername($username);

        $biaya = JenisAnggota::findOne(1);
---
SELECT * FROM `jenis_anggota` WHERE `id`=1

    protected function findModel($id)
    {
        if (($model = Members::findOne($id)) !== null) {
---
SELECT * FROM `members` WHERE `ID`='3'